[
  {
    "tag": "bbb",
    "name": "Barnacles, Beers and Brawls (2024)",
    "source": "barnacles.png",
    "alt": "Barnacles Beers and Brawls Logo",
    "itch": "https://magusconjurer.itch.io/barnacles-beers-and-brawls",
    "steam": "https://store.steampowered.com/app/2878180/Barnacles_Beers_and_Brawls/",
    "github": "",
    "team": 27,
    "time": "October 2023 - April 2024",
    "description": "A pirate bar management sim where you complete minigames and take care of your customers to make a profit before the time runs out.",
    "tech": "UE 5.2, C++, Blueprint, Visual Studio, Perforce Helix Core",
    "contributions": [
      "---- ALPHA ----",
      "Created and updated various engineering tasks on the team Trello board.",
      "Created a rough UML outline for potential systems.",
      "Created basic UI and functionality for a shop menu.",
      "Setup a basic interactable interface and microgame parent class.",
      "Implemented walking up to an interactable, zooming in the camera to microgame, and then returning to main camera view afterwards.",
      "Implemented a basic microgame system and the first version of the beer filling microgame.",
      "Participated in team discussion about pivoting production focus based on instructor presentation.",
      "Checked in with engineering team members to get updates on their progress and help with any problems they were running into, such as issues with Perforce.",
      "Updated microgame system to support a countdown timer and toggling whether the microgame can be repeated.",
      "Updated beer filling microgame based on playtest feedback.",
      "Resolved issues with the microgame not resetting when it was repeated.",
      "Generated a packaged build, resolved a number of file naming errors, and uploaded to Itch.io for playtesting.",
      "Presented the in-game progress of our game to the class.",
      "---- BETA ----",
      "Created Discord threads for discussing features with the assigned designer.",
      "Participated in design discussions to identify what systems were still wanted and changes that were needed.",
      "Participated in discussions about the gameplay loop and what tasks the team should focus on.",
      "Implemented character and NPC AI controllers.",
      "Implemented an indicator above the NPC to show their current status.",
      "Implement an NPC spawner with various settings for controlling the number and frequency of NPCs being spawned.",
      "Implemented a rough way for the status indicators to still show when the NPC is off screen.",
      "Updated NPC status indicator to include an icon to indicate their current request.",
      "Updated how NPCs look for available destinations, face the table, and notify the gamemode with satisfaction result.",
      "Update NPCs to use location markers to know where to spawn, exit, and brawl.",
      "Resolved a number of crashes caused by the NPCs.",
      "Generated sprint playtest builds every two weeks and uploaded them to Itch.io.",
      "---- EARLY ACCESS ----",
      "Participated in discussion to plan out the final goals of the project.",
      "Implement having the chairs get knocked over and picked up to indicate when it is not available after the NPC goes to brawl.",
      "Implement a main menu with placeholders for the options and credits.",
      "Update the delivery system to support multiple places at each table and how the NPCs access it.",
      "Update beer filling and brawl microgames to support controller input.",
      "Updated cutscenes to only display once per play session.",
      "Updated spawners to not start until the cutscene is completed or the player enters the bar.",
      "Update the NPCs to slip on spills like the player does and have a chance to start a brawl.",
      "Updated how beers carried by the player get spilled after a slip.",
      "Updated main and pause menus to support basic controller navigation.",
      "Troubleshooted controller input.",
      "Troubleshooted performance issues with one of the tech artists.",
      "Resolve additional crashes caused by the NPCs.",
      "Resolve issue where the microgames would not pause the spawners while active.",
      "Resolve issues where the NPCs would not spawn, not leave, or would continue to show a status indicator after being served.",
      "Generated sprint playtest builds every two weeks and uploaded them to Itch.io.",
      "---- FINAL BUILD ----",
      "Implemented the level system with an end of level screen to show player stats.",
      "Updated pause menu to include a way to return to the main menu.",
      "Updated main menu to include continue and new game functionality.",
      "Updated NPCs to support using the different available textures.",
      "Updated brawl microgame to use the same texture as the NPC that started it.",
      "Updated microgames to support having different settings based on the level number.",
      "Disabled the shop menu.",
      "Resolved an issue where the coin effect would play even if you received no coins.",
      "Resolved an error caused when the tutorial is skipped.",
      "Resolved an issue where the barrel spawner would not pause during microgames.",
      "Troubleshooted potential ways to fix the NPC off screen status indicators showing in the wrong place.",
      "Generated final build, uploaded it to Itch.io, and provided files to the team for uploading to Steam."
    ]
  },
  {
    "tag": "safe_spaces",
    "name": "Safe Spaces (2023)",
    "source": "safe_spaces.png",
    "alt": "Safe Spaces project image",
    "itch": "https://magusconjurer.itch.io/safe-spaces",
    "steam": "",
    "github": "https://github.com/MagusConjurer/assorted-fruits-game",
    "team": 7,
    "time": "February 2023 - May 2023",
    "description": "A LGBTQ+ mental health empathy game with visual novel and bullet-hell segments created during an alternative/serious game development course at the University of Utah.",
    "tech": "GameMaker, GML Code",
    "contributions": [
      "---- PROTOTYPE ----",
      "Managed engineering tasks on team Trello board.",
      "Setup GameMake project and Github repo with basic structure.",
      "Implemented basic overworld funcitonallity (player, walls, decor, interactables).",
      "Implemented basic bullet hell functionality (player, bubbles, projectiles). Applied changes to movement, win condition, and collisions based on feedback from designers.",
      "Implemented basic dialogue functionality (portrait, dialogue box, continue button).",
      "Created main menu (play, settings, quit), pause menu (continue, main menu, quit), and settings menu (fullscreen toggle, music/sfx volumes, placeholder for resolution).",
      "---- VERTICAL SLICE ----",
      "Setup an Itch.io page for internal playtesting and later public release.",
      "Updated bullet hell to add a progress bar, ifreams, and ability hotkey.",
      "Updated bullet hell based on designer feedback to add a boost, boost indicator, progress icon.",
      "Added macros and functions that allow for creating variation in bullet hell based on level and dialogue choices.",
      "Updated dialogue UI based on designer feedback and using new art.",
      "Updated camera movement to resolve some visual jitters.",
      "Added support for controller input.",
      "Added transitions betweeen rooms/levels.",
      "Resolved bugs with the player movement and interactions in the overworld.",
      "Resolved bugs with the bullet hell collision and progress bar.",
      "Resolved crash caused by the dialogue system.",
      "Resolved merge conflicts in the Github repo.",
      "---- FINAL BUILD ----",
      "Updated dialogue system to support having multiple different characters on one side.",
      "Updated how transitions and various conditions work to allow for a continue button on the main menu to work.",
      "Updated bullet hell to support different enemy types and patterns based on the final dialogue choice.",
      "Updated bullet hell abilities based on design changes, such as adding iframes to the dash and update the vignette slowly after a heal.",
      "Updated bullet hell to include additional information and hints.",
      "Assisted designers working on bullet hell balancing.",
      "Added environmental dialogue to the overworld.",
      "Resolved a crash caused by the menus being different sizes.",
      "Resolved issues with the draw order in various situations.",
      "Resolved a bug where using a controller could access disabled buttons.",
      "Resolved issues with the dialogue scaling and positioning.",
      "Published final build to the Itch.io page."
    ]
  },
  {
    "tag": "hopping_mad",
    "name": "Hopping Mad (2017)",
    "source": "hopping.png",
    "alt": "Hopping Mad project image",
    "itch": "",
    "steam": "",
    "github": "https://github.com/MagusConjurer/hopping-mad",
    "team": 4,
    "time": "September 2017 - December 2017",
    "description": "A 2D platforming game created during a traditional game development course at the University of Utah.",
    "tech": "C#, Unity (2017), Maya, SourceTree",
    "contributions": [
      "Quickly learned how to use Unity and C#.",
      "Implemented player movement and controls.",
      "Implemented enemy spawning and movement.",
      "Imported character models and tied animations in with the scripts.",
      "Investigated and resolved bugs with various features (collisions, spawning, applying damage, etc).",
      "Created main and pause menus with basic functionality.",
      "Managed the project's SourceTree repository, including resolving merge conflicts."
    ]
  }
]